[
  {
    "reviewer": "Lucy Cheyney",
    "reviewerLocation": "Dereham",
    "review": "Having failed my driving test four times, I decided after six years to give it another shot. Steve proved to be a fabulously patient instructor who managed to achieve the impossible. A pass with simply 2 minors. I am ecstatic!!!"
  },
  {
    "reviewer": "Tamsin Raines ",
    "reviewerLocation": "King's Lynn",
    "review": "\"Over the moon\" I passed my driving test first time with Steve 22 years ago! my husband who is Turkish needed a UK licence, after failing 3 times with other instructors we managed to track Steve down. His teaching is professional, accurate, patient and easy to understand. My husband passed yesterday. Two very happy past and present customers."
  },
  {
    "reviewer": "Paul Burden",
    "reviewerLocation": "St. Albans",
    "review": "I'm 34 years old and had never driven a car before I contacted Steve at Residential Intensive Driving Courses. In an incredibly short space of time, I was up to a standard which enabled me to pass my driving test first time. This was entirely down to Steve's knowledge, help and patience. If you are considering an intensive driving course, I would highly recommend Residential Intensive Driving Courses. Steve was extremely flexible to accommodate my needs and formulated a schedule which was convenient for myself. The accommodation was good and it was a pleasure to learn to drive in the beautiful Norfolk countryside. For anyone wishing to learn to drive quickly, this is a great option. Highly recommended."
  },
  {
    "reviewer": "Dawid Zebik",
    "reviewerLocation": "Fakenham",
    "review": "Witam mam na imie Dawid jestem Polakiem i aktualnie posiadam pelne prawo jazdy Uk. Zdalem swoj egzamin za pierwszym razem,bez zadnych problemow. Wszystko to zawdzieczam mojemu instruktorowi z Residental Driving School. Wzialem 18h kurs i jak dla mnie on wystarczyl. Przebieg kursu i podejscie instruktora bylo przyjazne,nie czulem sie zestresowan. Wyskoko polecam innym osobom ktore maja zamiar robic prawo jazdy w uk.Jeszcze raz dziekuje STEVE."
  },
  {
    "reviewer": "Hannah Swire",
    "reviewerLocation": "Hunstanton",
    "review": "Before I started the course, I had never set foot in a car so I was a little nervous and it did take me a little longer than anticipated to get to grips with the basics. Though after a few days of tuition, I finally got the hang of it, and resulted in passing my test with only a few minors! Steve is an exceptional driving instructor and made me feel completely at ease as soon as I met him, though his drawings of roundabouts, roads and trees are not exactly beautiful - he is lovely and I would recommend him to anybody!!!"
  },
  {
    "reviewer": "Lauren Scott",
    "reviewerLocation": "Coventry",
    "review": "After having had many hours of tuition with multiple driving instructors and failing 3 driving tests i had almost lost hope in ever being able to drive. I decided to book a 4 day residential course in Kings Lynn to enable me to regain my confidence and pass the test. The whole course from station pickup, accommodation to tuition is very well organised. Steve Fletcher is without a doubt the most patient instructor i had and made it his priority to be dedicated towards ensuring that I met the required test standard. I couldnt recommend his course enough for anyone who particularly, like me has lost confidence in driving or would benefit from the consistency of driving intensively over a number of days. As Steve told me before i booked the course it isnt a miracle cure but for me, having the opportunity to focus solely on my driving for 4 days enabled me to pass and I am very grateful to him."
  }
]
